export interface Problem {
  title: string;
  description: string;
  sample: {
    input: number;
    output: string;
    explanation: string;
  };
}



export const Problem_res: Problem[] = [ {
  title: "তরমুজ ভাগ করা",
  description:
    `
দুই বন্ধু একটি তরমুজ কিনেছে যার ওজন **w কেজি**। তারা তরমুজটিকে দুই ভাগে ভাগ করতে চায় এমনভাবে, যাতে,দুই ভাগের **প্রতিটিই জোড় (even)** 
কেজি হয় দুই ভাগের **কোনোটিই ০ কেজি না হয়** (অর্থাৎ শুন্য এর চেয়ে বড় হতে হবে)
তোমার কাজ হলো নির্ধারণ করা, তাদের কি তরমুজটিকে এমনভাবে ভাগ করা সম্ভব?
যদি সম্ভব হয়, তাহলে প্রিন্ট করবে \`\`\`YES\`\`\` নাহলে প্রিন্ট করবে \`\`\`NO\`\`\`
### **ইনপুট**
একটি পূর্ণসংখ্যা \`\`\`w\`\`\` (1 ≤ w ≤ 100) — তরমুজের ওজন
### **আউটপুট**
যদি \`\`\`w > 2\`\`\` এবং \`\`\`w\`\`\` জোড় সংখ্যা হয় → **YES** অন্যথায় → **NO**

---
### 🧪 উদাহরণ (Sample)

| Input | Output |
|-------|--------|
|  8    |   YES  |

**ব্যাখ্যা:**  
8 কেজিকে **2 + 6** অথবা **4 + 4** – দুইভাবেই জোড় ওজনের দুই ভাগে ভাগ করা যায় ✅

`,
  sample: {
    input: 8,
    output: "YES",
    explanation: "8 কে 2 + 6 অথবা 4 + 4 দুই জোড় ওজনে ভাগ করা যায়",
  },
}]
